---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.LooseDimensionFailures.LooseFaceSplitsForCurtainWall
source: html/cb38de9a-514d-efa4-fedf-9bcd93234cb6.htm
---
# Autodesk.Revit.DB.BuiltInFailures.LooseDimensionFailures.LooseFaceSplitsForCurtainWall Property

Switching element type to Curtain Family. All Split Face Regions in the element will be deleted.

## Syntax (C#)
```csharp
public static FailureDefinitionId LooseFaceSplitsForCurtainWall { get; }
```